In [1]:
import pandas as pd

s_df = pd.read_csv('../data/samsong.csv')
h_df = pd.read_csv('../data/hyundee.csv')

print(s_df)
print(h_df)

    요일     식비   교통비  문화생활비    기타
0  MON  19420  2560   4308  3541
1  TUE  16970  2499   7644  2903
2  WED  15091  2511   5674  2015
3  THU  17880  2545   8621  3012
4  FRI  27104  2993  23052  2508
5  SAT  29055  2803  15330  4901
6  SUN  23509  1760  19030  4230
    요일     식비   교통비  문화생활비    기타
0  MON  22420  2574   5339  5546
1  TUE  19940  2689   3524  2501
2  WED  18086  2281   5364  2234
3  THU  18863  2155   9942  3252
4  FRI  35144  2463  33511  2342
5  SAT  34952  2812  19397  4324
6  SUN  28513  2680  19925  4577

## dictionary 이용

In [2]:
days = s_df['요일']
samsong = s_df['문화생활비']
hyundee = h_df['문화생활비']

dic = {
    'day': days,
    'samsong': samsong,
    'hyundee': hyundee
}

In [3]:
df = pd.DataFrame(dic)
df

   day  samsong  hyundee
0  MON     4308     5339
1  TUE     7644     3524
2  WED     5674     5364
3  THU     8621     9942
4  FRI    23052    33511
5  SAT    15330    19397
6  SUN    19030    19925

## pandas : concat() 함수 이용

In [4]:
days = s_df.loc[:, '요일']
samsong = s_df.loc[:, '문화생활비']
hyundee = h_df.loc[:, '문화생활비']

In [5]:
df = pd.concat([days, samsong, hyundee], axis=1)
df.columns = ['day', 'samsong', 'hyundee']
df

   day  samsong  hyundee
0  MON     4308     5339
1  TUE     7644     3524
2  WED     5674     5364
3  THU     8621     9942
4  FRI    23052    33511
5  SAT    15330    19397
6  SUN    19030    19925